### Limpieza conjunta

In [1]:
#IMPORTANDO LIBRERIAS NECESARIAS
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', None)

In [2]:
df_limpio = pd.read_csv("hr_raw_data.csv", index_col=0)
df_limpio.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,"16280,83$","42330,17$",7,Y,No,13,"3,0",3,Full Time,0,NaN,5,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,"43331,17$",0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,"41669,33$",1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,"14307,50$","37199,50$",3,Y,NaN,19,"3,0",2,Full Time,2,NaN,2,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,"12783,92$","33238,20$",2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

### Columnas Gabi

In [3]:
#Vamos a limpiar la columna age
df_limpio['age'] = df_limpio['age'].str.strip().str.lower()

In [4]:
def convertir_a_numero(valor):
    try:
        return int(valor)
    except ValueError: # tengo que aplicar defensiva para que los que no pueda cambiar porque estan ok no me de error
        try:
            return w2n.word_to_num(valor)
        except:
            return None

In [5]:
df_limpio['age'] = df_limpio['age'].apply(convertir_a_numero)

In [6]:
df_limpio["age"].unique()

array([51., 52., 42., 47., 46., 48., 59., 41., 56., 38., 55., 40., 58.,
       35., 45., 33., 36., 34., nan, 53., 43., 60., 32., 37., 49., 39.,
       50., 44., 30., 29., 31., 54., 57., 27., 28., 26., 25., 24., 23.,
       22., 21., 20., 19., 18.])

In [58]:
df_limpio["age"] = df_limpio["age"].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [7]:
df_limpio["distancefromhome"].unique()

array([  6,   1,   4,   2,   3,  22,  25,   9,   7,  23,  10,  12,  14,
       -13,  15,   8, -42,  28, -37,   5,  16, -35,  26, -26,  24,  29,
       -25,  17,  21, -18, -10, -30, -27,  20, -31, -29, -39,  18, -21,
       -15,  11,  13, -14,  19, -33, -34, -46, -36, -19,  27, -12, -23,
       -45, -28, -47, -32, -24, -16, -22, -41, -49, -11, -48, -38, -20,
       -17, -43, -40, -44], dtype=int64)

In [8]:
df_limpio["distancefromhome"] = df_limpio["distancefromhome"].abs()

In [9]:
df_limpio["distancefromhome"].unique()

array([ 6,  1,  4,  2,  3, 22, 25,  9,  7, 23, 10, 12, 14, 13, 15,  8, 42,
       28, 37,  5, 16, 35, 26, 24, 29, 17, 21, 18, 30, 27, 20, 31, 39, 11,
       19, 33, 34, 46, 36, 45, 47, 32, 41, 49, 48, 38, 43, 40, 44],
      dtype=int64)

In [10]:
df_limpio.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

In [11]:
# Quitamos employeecount porque el valor es 1 y no aporta información
df_limpio = df_limpio.drop(columns=["employeecount"])

In [12]:
df_limpio.columns #comprobamos que ya no está

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement',
       'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus',
       'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'over18',
       'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'numberchildren', 'remotework'],
      dtype='object')

### Columnas Irene

In [13]:
'''¿borramos hourlyrate?'''

'¿borramos hourlyrate?'

In [14]:
def minusculas(celda): #quitemos las mayúculas a jobrole
  try:
    return celda.lower()
  except:
    return celda

In [15]:
df_limpio['jobrole'] = df_limpio['jobrole'].apply(minusculas)

In [16]:
df_limpio['jobrole'] = df_limpio['jobrole'].str.strip()

In [17]:
df_limpio['jobrole'].unique()

array(['research director', 'manager', 'sales executive',
       'manufacturing director', 'research scientist',
       'healthcare representative', 'laboratory technician',
       'sales representative', 'human resources'], dtype=object)

In [18]:
df_limpio['maritalstatus'] = df_limpio['maritalstatus'].apply(minusculas)

In [19]:
df_limpio['maritalstatus'] = df_limpio['maritalstatus'].replace('marreid', 'married')

In [20]:
df_limpio['maritalstatus'].unique() #aplicamos minúsculas

array([nan, 'married', 'divorced', 'single'], dtype=object)

In [21]:
df_limpio['gender'].replace({0: 'Male', 1: 'Female'}, inplace=True)

C:\Users\irene\AppData\Local\Temp\ipykernel_27280\2639878342.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_limpio['gender'].replace({0: 'Male', 1: 'Female'}, inplace=True)

In [22]:
df_limpio['gender'].unique()

array(['Male', 'Female'], dtype=object)

In [23]:
df_limpio['environmentsatisfaction'] = np.where(
  df_limpio['environmentsatisfaction'].between(10, 49), # Valores de 2 dígitos
  df_limpio['environmentsatisfaction'] // 10,      # División entera (primer dígito)
  df_limpio['environmentsatisfaction']         # Valores 1-4 se mantienen
)

In [24]:
df_limpio['environmentsatisfaction'].unique()

array([1, 3, 4, 2], dtype=int64)

In [25]:
df_limpio['environmentsatisfaction'].value_counts()

environmentsatisfaction
4    509
3    490
1    341
2    338
Name: count, dtype: int64

In [26]:
df_limpio['monthlyincome'] = df_limpio['monthlyincome'].str.replace('$', '', regex=False).str.replace(',', '.', regex=False).astype(float)

In [27]:

df_limpio.rename(columns= {'monthlyincome': 'monthlyincome_$'}, inplace=True)

In [28]:
df_limpio['monthlyrate'] = df_limpio['monthlyrate'].str.replace('$', '', regex=False).str.replace(',', '.', regex=False).astype(float)

In [29]:
df_limpio.rename(columns= {'monthlyrate':'monthlyrate_$'}, inplace=True)

In [30]:
df_limpio.drop(columns=["hourlyrate"], inplace=True)

In [31]:
df_limpio.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 39 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1665 non-null   float64
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  jobinvolvement            1678 non-null   int64
 12  joblevel                  1678 non-null   int64
 13  jobrole                   1678 non-null   object
 14  jobsatisfaction           1678 non-null   int64
 15  maritalstatus             1003 non-null   object
 16  monthlyincome_$           1189 non-null   float64
 17  monthlyrate_$             1678 non-null   float64
 18  numcompaniesworked        1678 non-null   int64
 19  over18                    740 non-null    object
 20  overtime                  982 non-null    object
 21  percentsalaryhike         1678 non-null   int64
 22  performancerating         1478 non-null   object
 23  relationshipsatisfaction  1678 non-null   int64
 24  standardhours             1327 non-null   object
 25  stockoptionlevel          1678 non-null   int64
 26  totalworkingyears         1129 non-null   object
 27  trainingtimeslastyear     1678 non-null   int64
 28  worklifebalance           1564 non-null   object
 29  yearsatcompany            1678 non-null   int64
 30  yearsincurrentrole        35 non-null     object
 31  yearssincelastpromotion   1678 non-null   int64
 32  yearswithcurrmanager      1678 non-null   int64
 33  sameasmonthlyincome       1189 non-null   object
 34  datebirth                 1678 non-null   int64
 35  salary                    1393 non-null   object
 36  roledepartament           312 non-null    object
 37  numberchildren            0 non-null      float64
 38  remotework                1678 non-null   object
dtypes: float64(5), int64(16), object(18)
memory usage: 524.4+ KB

Columnas Ana

In [32]:
# borrar la columna 'over 18' ('redundante')
df_limpio.drop(columns=["over18"], inplace=True)

In [33]:
# borrar la columna 'totalworkingyears' (ya existe 'yearsatacompany')
df_limpio.drop(columns=["totalworkingyears"], inplace=True)

In [34]:
# 'worklifebalance' cambiar de objeto a numeric  
df_limpio["worklifebalance"] = pd.to_numeric(df_limpio["worklifebalance"], errors="coerce")

In [35]:
# 'performancerating' cambiar de objeto a numeric  
df_limpio["performancerating"] = pd.to_numeric(df_limpio["performancerating"], errors="coerce")

In [36]:
# gestion nulos de 'standardhours' 
df_limpio['standardhours'] = df_limpio['standardhours'].fillna("Unknown")

In [37]:
# gestion nulos de 'overtime'
df_limpio['overtime'] = df_limpio['overtime'].fillna("Unknown")

In [38]:
df_limpio.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 37 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1665 non-null   float64
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  jobinvolvement            1678 non-null   int64
 12  joblevel                  1678 non-null   int64
 13  jobrole                   1678 non-null   object
 14  jobsatisfaction           1678 non-null   int64
 15  maritalstatus             1003 non-null   object
 16  monthlyincome_$           1189 non-null   float64
 17  monthlyrate_$             1678 non-null   float64
 18  numcompaniesworked        1678 non-null   int64
 19  overtime                  1678 non-null   object
 20  percentsalaryhike         1678 non-null   int64
 21  performancerating         0 non-null      float64
 22  relationshipsatisfaction  1678 non-null   int64
 23  standardhours             1678 non-null   object
 24  stockoptionlevel          1678 non-null   int64
 25  trainingtimeslastyear     1678 non-null   int64
 26  worklifebalance           0 non-null      float64
 27  yearsatcompany            1678 non-null   int64
 28  yearsincurrentrole        35 non-null     object
 29  yearssincelastpromotion   1678 non-null   int64
 30  yearswithcurrmanager      1678 non-null   int64
 31  sameasmonthlyincome       1189 non-null   object
 32  datebirth                 1678 non-null   int64
 33  salary                    1393 non-null   object
 34  roledepartament           312 non-null    object
 35  numberchildren            0 non-null      float64
 36  remotework                1678 non-null   object
dtypes: float64(7), int64(16), object(14)
memory usage: 498.2+ KB

Columnas Carmen

In [39]:
if 'numberchildren' in df_limpio.columns:
    df_limpio.drop('numberchildren', axis=1, inplace=True)
    print("'numberchildren' ha sido eliminada.")
else:
    print("'numberchildren' no se encontró en el DataFrame.")

'numberchildren' ha sido eliminada.

In [40]:
df_limpio.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'jobinvolvement', 'joblevel',
       'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome_$',
       'monthlyrate_$', 'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

In [41]:
print("\nLimpiando 'yearsincurrentrole'...")
df_limpio['yearsincurrentrole'] = df_limpio['yearsincurrentrole'].str.replace(',', '.', regex=False).astype(float)
print("'yearsincurrentrole' convertida a tipo numérico (float).")

Limpiando 'yearsincurrentrole'...
'yearsincurrentrole' convertida a tipo numérico (float).

In [42]:
df_limpio['salary'] = df_limpio['salary'].str.replace('$', '', regex=False).str.replace(',', '.', regex=False).astype(float)

In [ ]:
salario = df_limpio['sameasmonthlyincome'] == df_limpio['monthlyincome_$']

In [46]:
salario.head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [ ]:
df_income = df_limpio[['monthlyincome_$', "sameasmonthlyincome", 'salary']]
df_income
#estudiar cómo sacar info de salary para monthlyincome

      monthlyincome_$ sameasmonthlyincome     salary
0            16280.83           16280,83$  195370.00
1                 NaN                 NaN  199990.00
2                 NaN                 NaN  192320.00
3            14307.50           14307,50$  171690.00
4            12783.92           12783,92$        NaN
...               ...                 ...        ...
1673          3949.17            3949,17$        NaN
1674         15943.72           15943,72$  191324.62
1675              NaN                 NaN   28111.13
1676          8339.32            8339,32$  100071.84
1677              NaN                 NaN   53914.11

[1678 rows x 3 columns]

In [51]:
df_limpio['roledepartament'] = df_limpio['roledepartament'].str.strip().str.lower()

In [54]:
df_limpio['roledepartament'].unique()

array([nan, 'manager  -  research & development',
       'healthcare representative  -  research & development',
       'sales executive  -  sales',
       'laboratory technician  -  research & development',
       'manufacturing director  -  research & development',
       'research scientist  -  research & development',
       'research director  -  research & development',
       'human resources  -  human resources', 'manager  -  sales',
       'sales representative  -  sales', 'manager  -  human resources'],
      dtype=object)

In [55]:
df_limpio['remotework'].unique()

array([ True, False])

In [52]:
mapa_booleano = {
    'Yes': True, '1': True, 1: True, 'True': True, True: True,
    'False': False, '0': False, 0: False, 'No': False, False: False
}

In [53]:
df_limpio['remotework'] = df_limpio['remotework'].map(mapa_booleano).astype(bool)

In [56]:
df_limpio.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1678 entries, 0 to 1677
Data columns (total 36 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       1665 non-null   float64
 1   attrition                 1678 non-null   object
 2   businesstravel            877 non-null    object
 3   dailyrate                 1678 non-null   float64
 4   department                312 non-null    object
 5   distancefromhome          1678 non-null   int64
 6   education                 1678 non-null   int64
 7   educationfield            904 non-null    object
 8   employeenumber            1678 non-null   int64
 9   environmentsatisfaction   1678 non-null   int64
 10  gender                    1678 non-null   object
 11  jobinvolvement            1678 non-null   int64
 12  joblevel                  1678 non-null   int64
 13  jobrole                   1678 non-null   object
 14  jobsatisfaction           1678 non-null   int64
 15  maritalstatus             1003 non-null   object
 16  monthlyincome_$           1189 non-null   float64
 17  monthlyrate_$             1678 non-null   float64
 18  numcompaniesworked        1678 non-null   int64
 19  overtime                  1678 non-null   object
 20  percentsalaryhike         1678 non-null   int64
 21  performancerating         0 non-null      float64
 22  relationshipsatisfaction  1678 non-null   int64
 23  standardhours             1678 non-null   object
 24  stockoptionlevel          1678 non-null   int64
 25  trainingtimeslastyear     1678 non-null   int64
 26  worklifebalance           0 non-null      float64
 27  yearsatcompany            1678 non-null   int64
 28  yearsincurrentrole        35 non-null     float64
 29  yearssincelastpromotion   1678 non-null   int64
 30  yearswithcurrmanager      1678 non-null   int64
 31  sameasmonthlyincome       1189 non-null   object
 32  datebirth                 1678 non-null   int64
 33  salary                    1393 non-null   float64
 34  roledepartament           312 non-null    object
 35  remotework                1678 non-null   bool
dtypes: bool(1), float64(8), int64(16), object(11)
memory usage: 473.6+ KB